# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.app_configuration.data.azurerm_client_config.hub: Reading...
data.azurerm_private_dns_zone.blob_storage: Reading...
module.app_configuration.data.azurerm_resource_group.hub: Reading...
data.azurerm_virtual_network.hub_vnet: Reading...
data.azurerm_private_dns_zone.hub_service_bus: Reading...
module.app_configuration.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.app_configuration.data.azurerm_resource_group.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_private_dns_zone.hub_service_bus: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net]
data.azurerm_private_dns_zone.blob_storage: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net]
data.azurerm_virtual_network.hub_vnet: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # azurerm_key_vault.key_vault will be destroyed
  # (because azurerm_key_vault.key_vault is not in configuration)
  - resource "azurerm_key_vault" "key_vault" {
      - access_policy                   = [] -> null
      - enable_rbac_authorization       = true -> null
      - enabled_for_deployment          = false -> null
      - enabled_for_disk_encryption     = false -> null
      - enabled_for_template_deployment = false -> null
      - id                              = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.KeyVault/vaults/kvaltinnauth001prod" -> null
      - location                        = "norwayeast" -> null
      - name                            = "kvaltinnauth001prod" -> null
      - public_network_access_enabled   = false -> null
      - purge_protection_enabled        = false -> null
      - resource_group_name             = "rgaltinnauth001prod" -> null
      - sku_name                        = "standard" -> null
      - soft_delete_retention_days      = 90 -> null
      - tags                            = {
          - "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          - "Environment" = "prod"
          - "Instance"    = "001"
          - "ProductName" = "auth"
        } -> null
      - tenant_id                       = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
      - vault_uri                       = "https://kvaltinnauth001prod.vault.azure.net/" -> null

      - network_acls {
          - bypass                     = "AzureServices" -> null
          - default_action             = "Allow" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }
    }

  # azurerm_log_analytics_data_export_rule.log_dwh will be created
  + resource "azurerm_log_analytics_data_export_rule" "log_dwh" {
      + destination_resource_id = (known after apply)
      + enabled                 = true
      + export_rule_id          = (known after apply)
      + id                      = (known after apply)
      + name                    = "StorageAccountDwh"
      + resource_group_name     = "rgaltinnauth001prod"
      + table_names             = [
          + "AzureActivity",
          + "AzureDiagnostics",
        ]
      + workspace_resource_id   = (known after apply)
    }

  # azurerm_log_analytics_linked_storage_account.log_dwh["Alerts"] will be created
  + resource "azurerm_log_analytics_linked_storage_account" "log_dwh" {
      + data_source_type      = "Alerts"
      + id                    = (known after apply)
      + resource_group_name   = "rgaltinnauth001prod"
      + storage_account_ids   = (known after apply)
      + workspace_resource_id = (known after apply)
    }

  # azurerm_log_analytics_linked_storage_account.log_dwh["CustomLogs"] will be created
  + resource "azurerm_log_analytics_linked_storage_account" "log_dwh" {
      + data_source_type      = "CustomLogs"
      + id                    = (known after apply)
      + resource_group_name   = "rgaltinnauth001prod"
      + storage_account_ids   = (known after apply)
      + workspace_resource_id = (known after apply)
    }

  # azurerm_log_analytics_linked_storage_account.log_dwh["Query"] will be created
  + resource "azurerm_log_analytics_linked_storage_account" "log_dwh" {
      + data_source_type      = "Query"
      + id                    = (known after apply)
      + resource_group_name   = "rgaltinnauth001prod"
      + storage_account_ids   = (known after apply)
      + workspace_resource_id = (known after apply)
    }

  # azurerm_log_analytics_linked_storage_account.telemetry["Alerts"] will be created
  + resource "azurerm_log_analytics_linked_storage_account" "telemetry" {
      + data_source_type      = "Alerts"
      + id                    = (known after apply)
      + resource_group_name   = "rgaltinnauth001prod"
      + storage_account_ids   = (known after apply)
      + workspace_resource_id = (known after apply)
    }

  # azurerm_log_analytics_linked_storage_account.telemetry["CustomLogs"] will be created
  + resource "azurerm_log_analytics_linked_storage_account" "telemetry" {
      + data_source_type      = "CustomLogs"
      + id                    = (known after apply)
      + resource_group_name   = "rgaltinnauth001prod"
      + storage_account_ids   = (known after apply)
      + workspace_resource_id = (known after apply)
    }

  # azurerm_log_analytics_linked_storage_account.telemetry["Query"] will be created
  + resource "azurerm_log_analytics_linked_storage_account" "telemetry" {
      + data_source_type      = "Query"
      + id                    = (known after apply)
      + resource_group_name   = "rgaltinnauth001prod"
      + storage_account_ids   = (known after apply)
      + workspace_resource_id = (known after apply)
    }

  # azurerm_log_analytics_workspace.log_dwh will be created
  + resource "azurerm_log_analytics_workspace" "log_dwh" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "norwayeast"
      + name                            = "logdwhaltinnauth001prod"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "rgaltinnauth001prod"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + workspace_id                    = (known after apply)
    }

  # azurerm_monitor_diagnostic_setting.service_bus_diagnostics will be created
  + resource "azurerm_monitor_diagnostic_setting" "service_bus_diagnostics" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = (known after apply)
      + name                           = "logdwhaltinnauth001prod"
      + target_resource_id             = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod"

      + enabled_log {
          + category_group = "allLogs"
            # (1 unchanged attribute hidden)
        }
      + enabled_log {
          + category_group = "audit"
            # (1 unchanged attribute hidden)
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # azurerm_private_endpoint.blob will be updated in-place
  ~ resource "azurerm_private_endpoint" "blob" {
        id                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pepstblobaltinnauth001prod"
        name                          = "pepstblobaltinnauth001prod"
        tags                          = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "prod"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (7 unchanged attributes hidden)

      ~ private_dns_zone_group {
            id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pepstblobaltinnauth001prod/privateDnsZoneGroups/staltinnauth001prod"
            name                 = "staltinnauth001prod"
          ~ private_dns_zone_ids = [
              ~ "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net" -> "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

        # (1 unchanged block hidden)
    }

  # azurerm_private_endpoint.blob_dwh will be created
  + resource "azurerm_private_endpoint" "blob_dwh" {
      + custom_dns_configs            = (known after apply)
      + custom_network_interface_name = "nicstdwhblobaltinnauth001prod"
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "pepstdwhblobaltinnauth001prod"
      + network_interface             = (known after apply)
      + private_dns_zone_configs      = (known after apply)
      + resource_group_name           = "rgaltinnauth001prod"
      + subnet_id                     = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001prod/subnets/Default"
      + tags                          = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "stdwhaltinnauth001prod"
          + private_dns_zone_ids = [
              + "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "stdwhaltinnauth001prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # azurerm_private_endpoint.key_vault will be destroyed
  # (because azurerm_private_endpoint.key_vault is not in configuration)
  - resource "azurerm_private_endpoint" "key_vault" {
      - custom_dns_configs            = [] -> null
      - custom_network_interface_name = "nickvaltinnauth001prod" -> null
      - id                            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pepkvaltinnauth001prod" -> null
      - location                      = "norwayeast" -> null
      - name                          = "pepkvaltinnauth001prod" -> null
      - network_interface             = [
          - {
              - id   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/networkInterfaces/nickvaltinnauth001prod"
              - name = "nickvaltinnauth001prod"
            },
        ] -> null
      - private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pepkvaltinnauth001prod/privateDnsZoneGroups/privatelink.vaultcore.azure.net/privateDnsZoneConfigs/privatelink.vaultcore.azure.net"
              - name                = "privatelink.vaultcore.azure.net"
              - private_dns_zone_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net"
              - record_sets         = [
                  - {
                      - fqdn         = "kvaltinnauth001prod.privatelink.vaultcore.azure.net"
                      - ip_addresses = [
                          - "10.202.240.4",
                        ]
                      - name         = "kvaltinnauth001prod"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name           = "rgaltinnauth001prod" -> null
      - subnet_id                     = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001prod/subnets/Default" -> null
      - tags                          = {
          - "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          - "Environment" = "prod"
          - "Instance"    = "001"
          - "ProductName" = "auth"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/privateEndpoints/pepkvaltinnauth001prod/privateDnsZoneGroups/privatelink.vaultcore.azure.net" -> null
          - name                 = "privatelink.vaultcore.azure.net" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection              = false -> null
          - name                              = "kvaltinnauth001prod" -> null
          - private_connection_resource_id    = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.KeyVault/vaults/kvaltinnauth001prod" -> null
          - private_ip_address                = "10.202.240.4" -> null
          - subresource_names                 = [
              - "vault",
            ] -> null
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_role_assignment.key_vault_administrator will be destroyed
  # (because azurerm_role_assignment.key_vault_administrator is not in configuration)
  - resource "azurerm_role_assignment" "key_vault_administrator" {
      - id                                     = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.KeyVault/vaults/kvaltinnauth001prod/providers/Microsoft.Authorization/roleAssignments/0a1ac96f-f804-56e3-9332-6ce57a499a67" -> null
      - name                                   = "0a1ac96f-f804-56e3-9332-6ce57a499a67" -> null
      - principal_id                           = "31b04051-ab3b-439d-b8fa-3e7b3f6b68ba" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/providers/Microsoft.Authorization/roleDefinitions/00482a5a-887f-4fb3-b363-3b7fe8e74483" -> null
      - role_definition_name                   = "Key Vault Administrator" -> null
      - scope                                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.KeyVault/vaults/kvaltinnauth001prod" -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_servicebus_namespace.service_bus will be updated in-place
  ~ resource "azurerm_servicebus_namespace" "service_bus" {
        id                                  = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod"
        name                                = "sbaltinnauth001prod"
      ~ public_network_access_enabled       = false -> true
        tags                                = {
            "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
            "Environment" = "prod"
            "Instance"    = "001"
            "ProductName" = "auth"
        }
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_storage_account.storage_dwh will be created
  + resource "azurerm_storage_account" "storage_dwh" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "GRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "norwayeast"
      + min_tls_version                    = "TLS1_2"
      + name                               = "stdwhaltinnauth001prod"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rgaltinnauth001prod"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "CreatedAt"   = "Tuesday, 02-Jan-18 23:12:01 UTC"
          + "Environment" = "prod"
          + "Instance"    = "001"
          + "ProductName" = "auth"
        }

      + blob_properties {
          + change_feed_enabled      = true
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = true
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

Plan: 11 to add, 2 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `infra/deploy/spoke` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/spokes.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_spokes.tfstate.tfplan`